<?php
$info[0] = 'размер загруженного файла превышает размер установленный параметром upload_max_filesize  в php.ini ';
$info[1] = 'размер загруженного файла превышает размер установленный параметром MAX_FILE_SIZE в HTML форме. ';
$info[2] = 'загружена только часть файла ';
$info[3] = 'файл не был загружен (Пользователь в форме указал неверный путь к файлу). ';
$info[4] = 'неверная временная дирректория';
$info[5] = 'ошибка записи файла на диск';
$info[6] = 'загрузка файла прервана';
$info[7] = 'Возникла неизвесная ошибка';
$info[8] = 'уже существует.'
?>