<?php
$info[0] = 'розмір файла який Ви завантажуєте перевищує встановлений upload_max_filesize  в php.ini ';
$info[1] = 'розмір файлу який ви завантажуєте перевищує розмів встановлений параметром MAX_FILE_SIZE в HTML формі. ';
$info[2] = 'завантажена тільки частина файлу ';
$info[3] = 'файл не був завантажений (Користувач в формі вказав невірний шлях до файлу). ';
$info[4] = 'невірна тимчасова директорія';
$info[5] = 'помилка запису файлу на диск';
$info[6] = 'завантаження файлу перервано';
$info[7] = 'Виникла невідома помилка';
$info[8] = 'вже існує.'
?>